In [1]:
import pandas as pd

In [33]:
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp",header=0)

In [34]:
table= tables[0]

In [35]:
table

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [42]:
table.to_excel("info.xlsx")

In [43]:
names = ["PP","Ravo","aka","pp","ss"]

In [44]:
ages = [28,21,15,21,23]

In [46]:
s_names=pd.Series(names)

In [47]:
s_ages = pd.Series(ages)

In [50]:
table = pd.DataFrame([s_names,s_ages]).T

In [51]:
table

      0   1
0    PP  28
1  Ravo  21
2   aka  15
3    pp  21
4    ss  23

In [57]:
table = pd.DataFrame({"name":s_names, "age":s_ages})

In [58]:
table

   name  age
0    PP   28
1  Ravo   21
2   aka   15
3    pp   21
4    ss   23

In [60]:
list(zip(names,ages))

[('PP', 28), ('Ravo', 21), ('aka', 15), ('pp', 21), ('ss', 23)]

In [61]:
table.dtypes

name    object
age      int64
dtype: object

In [74]:
table.name

0      PP
1    Ravo
2     aka
3      pp
4      ss
Name: name, dtype: object